[
  {
    "github": "vavroom",
    "twitter": "vavroom",
    "fullName": "Nic Steenhout",
    "bio":
      "Nicolas Steenhout offers real-world insight into everyday accessibility issues. \nHis work began in the mid-'90s. As a developer, he was approached by clients facing challenges not yet part of the public consciousness. On the emerging web, accessibility hurdles were keeping people with disabilities from engaging with a technological revolution. \n\nAs Nic began championing web accessibility, he transitioned into the non-profit sector where he collaborated with people with a wide variety of impairments. \n\nToday, Nic continues his accessibility work as an independent consultant for private businesses and non-profits. Having worked on three continents, he’s engaged with thousands of individuals with disabilities.",
    "title": "Accessibility consultant",
    "company": "Knowbility",
    "photoUrl":
      "https://incl.ca/wp-content/uploads/2008/04/nicsteenhout-300x300.jpg",
    "talkLength": "30-35 minute talk",
    "talkTitle": "Accessibility: Don't turn off that JavaScript just yet!",
    "talkDescription":
      "Long gone are the days when you couldn’t use JavaScript on a site and make it work for people with disabilities. Many now even use JavaScript to increase accessibility, and not just by throwing in a couple ARIA tags. Considering accessibility when building scripts remains essential! We will look at a few ways to use JavaScript and ensure that accessibility is not only preserved, but even improved.\n\nUsed to be you couldn't use JavaScript and have an accessible site for people with disabilities. These days are long gone. You can now even use JavaScript to increase accessibility. We will look at a few ways to use JavaScript and ensure that accessibility is not only preserved, but even improved.\n\nAbstract: \n\nIt wasn’t so many years ago that some accessibility experts would turn off JavaScript to test a site and deem it inaccessible if they couldn’t use the site. Things have changed. Assistive technology, including screenreaders, have come a long way and can interact with JavaScript, if accessibility has been kept in mind. Surveys consistently show that over 97% of screenreader users have JavaScript enabled. Not to mention people with disabilities that don’t use screenreader software and also have JavaScript enabled. Planning for (and maintaining) a <noscript> solution is not going to make a page accessible.\n\nIf you develop websites or web-based applications and use JavaScript, this presentation is for you. People with disabilities account for over a billion people worldwide. That’s roughly 15% of the world population who experiences challenges on the web because they can’t see the screen, hear media files, use a mouse, concentrate for long periods of time, perceive colors, etc. This, in effect, makes people with disabilities the world’s largest minority on the web with $220 Billion in discretionary spending power in the United States alone. Much bigger and influential than any other minority. Considering the needs of this population is only wise.\n\nIn this presentation, I will talk about some of the issues that can arise from using JavaScript, and how to use it while maintaining accessibility. I will briefly discuss ARIA, but the meat of the presentation will consist of:\n\n• Event handlers,\n• Pop-up windows,\n• Page refreshes,\n• JavaScript generated content.\n\nTakeaway for the audience\n\nThe audience will gain an understanding of the impact of disabilities on using the web, beyond screenreaders, and will see some simple ways to improve the accessibility of common tasks conducted with JavaScript.",
    "audienceLevel": "Introductory",
    "location": "Montreal, QC"
  },
  {
    "github": "prpatel",
    "twitter": "prpatel",
    "fullName": "Pratik Patel",
    "bio":
      "Pratik Patel is the CTO of Atlanta based TripLingo and never met a programming language he didn't like (except for Perl)",
    "title": "CTO",
    "company": "TripLingo",
    "photoUrl": "https://i.imgur.com/4OuK7vA.png",
    "talkLength": "30-35 minute talk",
    "talkTitle": "Applied Machine Learning in the Browser",
    "talkDescription":
      "In this presentation, we'll discuss the basics of machine learning, and learn how to use pre-built ML models - right in the web browser! We'll use a pre-trained model, load it up in the browser, and build a Web application that allows us to query the IMDB dataset - all without going to a server. We'll use Tensorflow.js, take a standard HD5 Tensorflow trained model, and use it right in the web browser!",
    "audienceLevel": "Intermediate",
    "location": "Atlanta, GA"
  },
  {
    "github": "sxywu",
    "twitter": "sxywu",
    "fullName": "Shirley Wu",
    "bio": "",
    "title": "Freelance Data Visualization Engineer",
    "company": "",
    "photoUrl": "https://i.imgur.com/n95OrJ6.jpg",
    "talkLength": "30-35 minute talk",
    "talkTitle": "Data Visualization for JS Developers",
    "talkDescription":
      "As front-end developers, we may be asked to create a visualization with D3.js. If the experience goes well, we may find ourselves falling in love with D3.js and looking to build more data visualizations in our spare or work time. But how can we go from fiddling with D3.js code to building full, thoughtful, and communicative visualizations for the web? In this talk, Shirley will highlight the challenges she faced and lessons she learned while creating custom visualizations.  She'll provide guidance on how to go beyond the code: how to explore the data for insights, to design a visualization around that insight, and to translate that design into code.",
    "audienceLevel": "",
    "location": "San Francisco, CA"
  },
  {
    "github": "wordofchristian",
    "twitter": "wordofchristian",
    "fullName": "Christian Schlensker",
    "bio":
      "Javascript developer. Former designer. Occasional pixel artist. Karaoke enthusiast. Salad hater. Foreign language lover",
    "title": "Lead Frontend Engineer",
    "company": "Bugsnag",
    "photoUrl": "https://i.imgur.com/46dvEv1.jpg",
    "talkLength": "30-35 minute talk",
    "talkTitle": "Parlez-vous Javascript?",
    "talkDescription":
      "The overall theme of the talk is an exploration of what makes good programming language design. What steps can be taken that eases use, predictability and understanding. I will give specific examples of « warts » in JavaScript that violate good design practices (as well as other programming languages) and discuss why it is the way it is. Additionally, for the fun absurdity of it, I will examine different spoken languages from the perspective of programming language design principles and dissect the \"public API\" of these languages (specifically English, French, and Japanese). \n\nTopics covered\n- Basic principles of language design\n- Why Javascript is so weird\n- Why counting in Japanese is easy?\n- What do French numbers have to do with Abe Lincoln and stoner culture?\n- HISTORY!",
    "audienceLevel": "Introductory",
    "location": "San Francisco, CA"
  },
  {
    "github": "samanthabretous",
    "twitter": "samanthabretous",
    "fullName": "Samantha Bretous",
    "bio":
      "Software Engineer at MLS blending the gap between web and mobile development through universal components. By day Samantha codes and is a DIY’er. At night she sleeps.",
    "title": "Software Engineer",
    "company": "",
    "photoUrl": "https://i.imgur.com/iqsBgoi.jpg",
    "talkLength": "30-35 minute talk",
    "talkTitle": "The Mentor I Wish I Had",
    "talkDescription":
      "The first year as an engineer is scary. Is it imposter syndrome? Or is it the lack of experience? Who knows. But one thing is for certain, to be a successful junior you need a great senior. Hear my pitfalls, big wins and oops I pushed to master moments as I walk you through my first year as an engineer learning react and react native. \n\nDetails:\nHere are a of the many few topics I will go over: \nhaving a good mentorship program\ntools I didn't learn in bootcamp and now I could never live without\n- learning chrome dev tools\n- visual studio code and extensions (prettier, bracket highlighting, etc)\nthinking before coding\nreviewing pull requests\nunderstanding git when you accident push to master\ncontinuous learning \ntaking away element of learning - importance of GraphQL vs API's",
    "audienceLevel": "Intermediate",
    "location": "New York, NY"
  },
  {
    "github": "codingitwrong",
    "twitter": "CodingItWrong",
    "fullName": "Josh Justice",
    "bio":
      "Josh Justice has worked in web development for 14 years across many frontend and backend frameworks. He's passionate about increasing developers' quality-of-life by speaking and writing about agile development practices. He works as a consultant at Big Nerd Ranch and runs https://learntdd.in, a web site offering Test-Driven Development tutorials in a variety of frameworks.",
    "title": "Web Developer",
    "company": "Big Nerd Ranch",
    "photoUrl": "https://i.imgur.com/ImalSG2.jpg",
    "talkLength": "30-35 minute talk",
    "talkTitle": "Newbie’s Guide to Contributing to Babel",
    "talkDescription":
      "Babel is a tool many JavaScript developers use to enable writing modern language features on all platforms. It’s incredibly useful, but for most of us it feels like a mysterious black box. We just drop in preset-env and we’re set! It’s great that it’s so easy to get started with Babel, but there’s also value in understanding how it works.\n\nI got to spend a week contributing to the private class fields feature for Babel that was recently released to beta. During that week, I went from knowing nothing about how Babel works to being able to fix some failing tests and implement new edge cases. As part of this process, I had to get up to speed quickly on Babel’s plugin and transformation systems. And I’d like to share what I learned with you.\n\nWe’ll go through:\n\n- What public and private class fields are, and how they work.\n- The code Babel transforms class fields into to get them to work on JavaScript engines that don’t support them—and how you can find this info in the Babel tests.\n- A brief overview of what Abstract Syntax Trees (ASTs) and transformations are, in case you aren’t familiar.\n- How the class fields transformations are implemented: the steps Babel goes through to transform your code.\n- The difference between loose and strict mode, and how strict modes reveals some details about the class fields spec.\n- How different Babel plugins interact with one another, and how it can lead to difficult-to-track bugs during plugin development.\n\nThis information will help you understand JavaScript more deeply and have greater confidence in the Babel features you’re using. And you can even apply it to writing your own personal Babel plugins, or contributing to Babel itself!",
    "audienceLevel": "Intermediate",
    "location": "Atlanta, GA"
  },
  {
    "github": "evanbacon",
    "twitter": "baconbrix",
    "fullName": "Evan Bacon",
    "bio":
      "I open source 3D games with Expo! Currently working on Expo + three.js to create dope AR/VR cross-platform apps. Also a Lego Master Builder 🙃",
    "title": "Developer",
    "company": "Expo",
    "photoUrl": "https://i.imgur.com/353phgH.jpg",
    "talkLength": "30-35 minute talk",
    "talkTitle": "",
    "talkDescription": "",
    "audienceLevel": "",
    "location": "San Francisco, CA"
  },
  {
    "github": "cjihrig",
    "twitter": "cjihrig",
    "fullName": "Colin Ihrig",
    "bio":
      "Colin Ihrig is a member of the Node.js Core Technical Committee, a libuv collaborator, and a hapi.js core team member. Colin is the author of Pro Node.js for Developers, and co-author of Full Stack JavaScript Development with MEAN.",
    "title": "Product Engineer",
    "company": "Joyent",
    "photoUrl": "https://avatars2.githubusercontent.com/u/2512748",
    "talkLength": "5 minute lightning talk",
    "talkTitle": "The State of Node Core",
    "talkDescription":
      "Node.js, as a platform, is constantly changing and evolving. Node's core is a melting pot of features from our own community, as well as dependencies such as V8 and libuv. This talk will cover the latest developments in Node core, including the upcoming Node 11.",
    "audienceLevel": "Introductory",
    "location": "Pittsburgh, PA"
  },
  {
    "github": "",
    "twitter": "Oliravi",
    "fullName": "Olivia Liddell",
    "bio":
      "Olivia Liddell is a Cloud Training Specialist at Cloudbakers. She is a former Chicago Public Schools teacher who now specializes in technology training and change management. She is passionate about teaching, mentoring, and distance running.",
    "title": "Cloud Training Specialist",
    "company": "Cloudbakers",
    "photoUrl": "https://i.imgur.com/T3OpGxi.jpg",
    "talkLength": "5 minute lightning talk",
    "talkTitle": "Building and Sustaining Strong Teams",
    "talkDescription":
      "In this talk, you'll learn some quick strategies for how to improve your group dynamics and work more effectively as a team.",
    "audienceLevel": "",
    "location": "Chicago, IL"
  },
  {
    "github": "ballenwillis",
    "twitter": "ballenwillis",
    "fullName": "Brandon Willis",
    "bio":
      "Brandon Willis is a Junior at UofI Urbana-Champaign majoring in computer science. He’s currently leading a team in the development of his childhood dream app “Own The Spot” - an app for the skateboarding community. In his free time, Brandon enjoys skateboarding, playing tennis, and shooting pool.",
    "title": "Student / Software Engineer",
    "company": "University of Illinois",
    "photoUrl": "https://i.imgur.com/SILdFM0.jpg",
    "talkLength": "5 minute lightning talk",
    "talkTitle":
      "Turn your database into a fully functioning GraphQL API in just 1 line",
    "talkDescription": "",
    "audienceLevel": "",
    "location": "Chicago, IL"
  },
  {
    "github": "beccanelson",
    "twitter": "beccaliz",
    "fullName": "Becca Nelson",
    "bio":
      "Becca is a software engineer who spent the first five years of her career as a fine arts teacher and occasional writer. After her career shift, she has become passionate about helping fellow artists and career changers understand the world of tech. \n\nShe is now a Software Crafter at 8th Light, where she can mentor new developers and help clients make better decisions about their software. In her not-so-abundant spare time, she loves knitting with her cat.",
    "title": "Lead Crafter",
    "company": "8th Light",
    "photoUrl": "https://8thlight.com/images/team/becca-nelson-9d7b86ca.jpg",
    "talkLength": "5 minute lightning talk",
    "talkTitle": "JavaScript Survival Skills",
    "talkDescription":
      "New technology fatigue is real.\n\nIn my first year and a half as a software consultant, I have worked on projects in Backbone, Angular 2, React, and Vue.js—and that’s just the JavaScript frameworks. I have worked on front-end code and back-end code with dozens of different testing frameworks, libraries, and build tools. Needless to say, I am exhausted.\n\nI know I am not alone in this, because the JavaScript world is always changing. Life as a perpetual beginner is both exciting and daunting, and it can supercharge imposter syndrome, especially for those of us who are new to the industry. In order to save us all, I have explored a few strategies for surviving the world of front-end development as a consultant, a beginner, or a frequent context-switcher. Let’s talk about some of the pros and cons of micro architecture, web components, and framework-agnostic design patterns.",
    "audienceLevel": "Intermediate",
    "location": "Chicago, IL"
  },
  {
    "github": "dabit3",
    "twitter": "dabit3",
    "fullName": "Nader Dabit",
    "bio":
      "Nader Dabit is a Developer Advocate at Amazon Web Services specializing in cross-platform application development.",
    "title": "Developer Advocate",
    "company": "Amazon Web Services",
    "photoUrl": "https://i.imgur.com/pN310K9.jpg",
    "talkLength": "5 minute lightning talk",
    "talkTitle": "GraphQL Can do What?",
    "talkDescription":
      "GraphQL has evolved from being a new and cutting edge technology to something that is widely adopted by stable & enterprise companies over the course of the past couple of years. With new tools & services like AWS AppSync, your GraphQL API can be pushed and extended into amazing realms like AR / VR, Machine Learning, Artificial Intelligence, & Geospacial Queries. In this talk, we'll look at some crazy use yet interesting & real world use cases of a bleeding edge GraphQL API, and how we can go about easily implementing this functionality today.",
    "audienceLevel": "Intermediate",
    "location": "Jackson, MS"
  },
  {
    "github": "mercedesb",
    "twitter": "mercedescodes",
    "fullName": "Mercedes Bernard",
    "bio":
      "Mercedes Bernard is a senior software engineer with DevMynd in Chicago, Illinois. She has worked with clients in a wide range of industries including (but not limited to!) healthcare, performing arts, beverage distribution, pet food, hospitality, luxury consumer goods, and government. In her projects, she values technical know-how, non-technical language, and empathy so her clients and team members feel empowered, comfortable, and heard. She earned her degree in computer science from DePaul University with a minor in American Sign Language studies (but those skills are a little rusty). Outside of work, she tries to unplug and enjoys fiber arts, particularly dyeing wool, spinning yarn, and crocheting.",
    "title": "Senior Software Engineer",
    "company": "DevMynd",
    "photoUrl":
      "https://images.ctfassets.net/kueynwv98jit/70PYtOOlhKgwG40WoicIc0/2d41abe26487b6310eff9ccc390e7a18/MerBer-circle.png",
    "talkLength": "5 minute lightning talk",
    "talkTitle": "Optimizing SEO for Single Page Applications",
    "talkDescription": "",
    "audienceLevel": "",
    "location": "Chicago, IL"
  },
  {
    "github": "andjosh",
    "twitter": "andjosh",
    "fullName": "Josh Beckman",
    "bio":
      "Josh is a software engineer and team builder working in startups around Chicago. Originally trained in computational neuroscience and machine learning, he now leads the product and engineering at OfficeLuv, building APIs and apps to power the workplace (with lots of JavaScript!).",
    "title": "Director of Engineering",
    "company": "OfficeLuv",
    "photoUrl": "http://www.andjosh.com/images/page/mustache.jpg",
    "talkLength": "5 minute lightning talk",
    "talkTitle": "Dynamically Upgrading Long-Running App Sessions",
    "talkDescription":
      "Do you have a client-side JavaScript app that has long-running user sessions? How can you deliver them a new app version without breaking their session?\nWe have users that stay on our JS app for days or weeks at a time and needed a way to continuously deliver new app versions. This talk will quickly detail our tried and tested methods for delivering new app bundles at just the right time!",
    "audienceLevel": "Advanced",
    "location": "Chicago, IL"
  }
]
